clear;clc

# Mass Flows (tn/y)
m(1) = 32692.2; # Γλυκόζη
m(2) = 212.8; # Ουρία
m(3) = 283.79; # CSL
m(4) = 13643; # Γλυκερόλη
m(5) = 640.48; # Αραβιτόλη
m(6) =  168.82; # Αιθανόλη
m(7) = 165.99; # Οξικό Οξύ

# Molecular weights (tn/Mmol)
MW(1) =  180.156; # Γλυκόζη
MW(2) = 60.06;  # Ουρία
MW(3) = 38.270;   # CSL
MW(4) = 92.09;  # Γλυκερόλη
MW(5) = 152.14;  # Αραβιτόλη
MW(6) = 46.07;	  # Αιθανόλη
MW(7) = 60;	   # Οξικό Οξύ

# Molar Flows (Mmol/y)
n = m./MW;

# Aeriation
v_a = 0.5; # Ροή αέρα σε vvm
Vr = 1301.5; # Όγκος υγρού στον αντιδραστήρα
n_ai = v_a*Vr/22.4; # Συνολική μοριακή ροή αέρα σε kmol/min
n_a = n_ai*8760/1000; # Συνολική μοριακή ροή αέρα σε Mmol/y
n_O = n_a*0.21; # Μοριακή ροή οξυγόνου Mmol/y

s_O = n_O/n(4)

# Stoichiometry (on glycerol basis)
s_gluc = n(1)/n(4)
s_urea = n(2)/n(4)
s_CSL = n(3)/n(4)
s_arab = n(5)/n(4)
s_eth = n(6)/n(4)
s_acet = n(7)/n(4)
