clear;clc

Fs0 = 3169; # Παροχή γλυκόζης στην τροφοδοσία [kg/h]

# Πειραματικά δεδομένα
S = [230.44, 228.57, 211.91, 202.3, 177.75, 168.85, 110.61, 86.32, 22.5, 13.26];
x = [0.9382, 2.18, 5.79, 8.36, 10.69, 10.75, 10.8, 10.83, 10.85, 10.68];

#x = [0.9382, 2.18, 5.79, 8.36, 10.69];
#S = [230.44, 228.57, 211.91, 202.3, 177.75];


rs = ((1.563*10^-3.*S)./(236.19+S)).*x; # Ρυθμός κατανάλωσης γλυκόζης [kg/m^3 h]
xs = (S(1)-S)./S(1); # Μετατροπή

Fsrs = Fs0./rs;

V_cstr = Fsrs(10)*xs(10)
V_pfr = trapz(xs, Fsrs)

plot(xs, Fsrs, "b-", "linewidth", 3)
